# Листинг 2.1
x = 2
y = 3
print(x, y)

# Листинг 2.2
x = 2
y = 3
# Сложение
z = x + y
print(z)  # Результат 5
# Вычитание
z = x - y
print(z)  # Результат -1
# Умножение
z = x * y
print(z)  # Результат 6
# Деление
z = x / y
print(z)  # Результат 0.66666...
# Возведение в степень
z = x ** y
print(z)  # Результат 8


# Листинг 2.3
def NameFun(p1, p2):
    return result


Itog = NameFun(a1, a2)


# Листинг 2.4
x = 2
y = 3
# Сложение
z = x + y
print(z)  # Результат 5
# Вычитание
z = x - y
print(z)  # Результат -1
# Умножение
z = x * y
print(z)  # Результат 6


# Листинг 2.5
x = 2
y = 3

# Сложение
z = x + y
print('Мы выполнили сложение переменных X и Y')
print("Результат Z=", z)  # Результат 5

# Вычитание
z = x - y
print('Мы выполнили вычитание переменных X и Y')
print("Результат Z=", z)  # Результат -1

# Умножение
z = x * y
print('Мы выполнили умножение переменных X и Y')
print("Результат Z=", z)  # Результат 6

# Деление
z = x / y
print('Мы выполнили деление переменных X и Y')
print("Результат Z=", z)  # Результат 0.6

# Возведение в степень
z = x ** y
print('Мы выполнили возведение в степень переменных X и Y')
print("Результат Z=", z)  # Результат 8
